fonecmid-diplom/src/Documents/ВКМ_НачислениеФиксированныхПремий/ВКМ_НачислениеФиксированныхПремий.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ВКМ_НачислениеФиксированныхПремий</name>
  <registerRecords>CalculationRegister.ВКМ_ОсновныеНачисления</registerRecords>
  <registerRecords>CalculationRegister.ВКМ_Удержания</registerRecords>
  <registerRecords>CalculationRegister.ВКМ_ДополнительныеНачисления</registerRecords>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Премии</name>
    <attributes>
      <name>Сотрудник</name>
      <type>
        <types>CatalogRef.Пользователи</types>
      </type>
    </attributes>
    <attributes>
      <name>РазмерПремии</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>12</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

fonecmid-diplom/src/CalculationRegisters/ВКМ_ДополнительныеНачисления/ВКМ_ДополнительныеНачисления.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:CalculationRegister>
  <name>ВКМ_ДополнительныеНачисления</name>
  <periodicity>Month</periodicity>
  <chartOfCalculationTypes>ChartOfCalculationTypes.ВКМ_ДополнительныеНачисления</chartOfCalculationTypes>
  <resources>
    <name>Результат</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>12</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Сотрудник</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </dimensions>
</mdclass:CalculationRegister>

fonecmid-diplom/src/CalculationRegisters/ВКМ_Удержания/ВКМ_Удержания.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:CalculationRegister>
  <name>ВКМ_Удержания</name>
  <periodicity>Month</periodicity>
  <basePeriod>true</basePeriod>
  <chartOfCalculationTypes>ChartOfCalculationTypes.ВКМ_Удержания</chartOfCalculationTypes>
  <resources>
    <name>Результат</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>12</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <attributes>
    <name>Реквизит</name>
    <type>
      <types>String</types>
      <types>ChartOfCalculationTypesRef.ВКМ_Удержания</types>
      <types>ChartOfCalculationTypesRef.ВКМ_ДополнительныеНачисления</types>
      <types>ChartOfCalculationTypesRef.ВКМ_ОсновныеНачисления</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <dimensions>
    <name>Сотрудник</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </dimensions>
</mdclass:CalculationRegister>

fonecmid-diplom/src/Documents/ВКМ_НачислениеФиксированныхПремий/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий
Процедура ОбработкаПроведения(Отказ, Режим) 
	
	Для Каждого ТекСтрокаПремии Из Премии Цикл
		
	     Движение = Движения.ВКМ_ДополнительныеНачисления.Добавить();
		 Движение.Сторно = Ложь;
		 Движение.ВидРасчета = ПланыВидовРасчета.ВКМ_ДополнительныеНачисления.ФиксированнаяПремия;
		 ДВижение.ПериодРегистрации = Дата;
		 ДВижение.Сотрудник = ТекСтрокаПремии.Сотрудник;
		 Движение.Результат = ТекСтрокаПремии.РазмерПремии;
		 
	КонецЦикла;

	Движения.ВКМ_ДополнительныеНачисления.Записать(); 
	
	РассчитатьУдержания(); 
//	
//	ВзаиморасчетыССотрудниками();
	
КонецПроцедуры 

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура РассчитатьУдержания() 
	
	Для Каждого ТекСтрокаПремии Из Премии Цикл
		
	     Движение = Движения.ВКМ_Удержания.Добавить();
		 Движение.Сторно = Ложь;
		 Движение.ВидРасчета = ПланыВидовРасчета.ВКМ_Удержания.НДФЛ;
		 ДВижение.ПериодРегистрации = Дата;
		 ДВижение.Сотрудник = ТекСтрокаПремии.Сотрудник;
		 Движение.Результат = ТекСтрокаПремии.РазмерПремии * 0.13;
		 
	КонецЦикла;

	Движения.ВКМ_Удержания.Записать(); 		

КонецПроцедуры
#КонецОбласти

#КонецЕсли
